{
    "api_type": {
        "description": "API类型",
        "type": "string",
        "hint": "选择API协议类型。切换类型后，将使用下方对应的URL和模型配置。",
        "enum": ["volcengine", "openai"],
        "default": "volcengine"
    },
    "volcengine_api_url": {
        "description": "【火山引擎】API地址",
        "type": "string",
        "hint": "火山引擎API地址。默认为 https://ark.cn-beijing.volces.com/api/v3/images/generations",
        "default": "https://ark.cn-beijing.volces.com/api/v3/images/generations"
    },
    "volcengine_model": {
        "description": "【火山引擎】模型名称",
        "type": "string",
        "hint": "火山引擎模型名称。例如: doubao-seedream-4-0-250828",
        "default": "doubao-seedream-4-0-250828"
    },
    "openai_api_url": {
        "description": "【OpenAI/SiliconFlow】API地址",
        "type": "string",
        "hint": "OpenAI格式API地址。SiliconFlow默认为 https://api.siliconflow.cn/v1/images/generations",
        "default": "https://api.siliconflow.cn/v1/images/generations"
    },
    "openai_model": {
        "description": "【OpenAI/SiliconFlow】模型名称",
        "type": "string",
        "hint": "OpenAI格式模型名称。例如: black-forest-labs/FLUX.1-schnell",
        "default": "black-forest-labs/FLUX.1-schnell"
    },
    "api_keys": {
        "description": "API 密钥列表",
        "type": "list",
        "hint": "可以填写多个密钥，插件会自动轮换使用。使用 #lm 添加key 命令进行管理。",
        "items": {
            "type": "string",
            "description": "API 密钥"
        },
        "default": []
    },
    "prefix": {
        "description": "【重要】是否要求指令必须带前缀",
        "type": "bool",
        "hint": "推荐开启。开启后，指令需要前缀（如 '#'）或 @机器人 才能触发，可避免日常聊天误触。",
        "default": true
    },
    "extra_prefix": {
        "description": "自定义提示词模式的前缀",
        "hint": "用于触发自定义prompt，例如设置为 'bnn'，则使用 'bnn <你的prompt>' 来调用",
        "type": "string",
        "default": "bnn"
    },
    "use_proxy": {
        "description": "是否启用网络代理",
        "type": "bool",
        "hint": "如果你的服务器无法直接访问 API 地址，请开启此项",
        "default": false
    },
    "proxy_url": {
        "description": "网络代理地址",
        "type": "string",
        "hint": "格式为 http://user:pass@host:port, 例如 http://127.0.0.1:7890",
        "default": ""
    },
    "user_whitelist": {
        "description": "【权限】用户白名单",
        "type": "list",
        "hint": "留空则对所有用户开放。填写后，只有在此列表中的用户才能使用本插件功能（管理员除外）。",
        "items": { "type": "string", "description": "用户QQ号" },
        "default": []
    },
    "user_blacklist": {
        "description": "【权限】用户黑名单",
        "type": "list",
        "hint": "黑名单优先级最高。在此列表中的用户将无法使用本插件功能（管理员除外）。",
        "items": { "type": "string", "description": "用户QQ号" },
        "default": []
    },
    "group_whitelist": {
        "description": "【权限】群聊白名单",
        "type": "list",
        "hint": "留空则在所有群聊中可用。填写后，只有在此列表中的群聊才能使用本插件功能。",
        "items": { "type": "string", "description": "群号" },
        "default": []
    },
    "group_blacklist": {
        "description": "【权限】群聊黑名单",
        "type": "list",
        "hint": "黑名单优先级最高。在此列表中的群聊将无法使用本插件功能。",
        "items": { "type": "string", "description": "群号" },
        "default": []
    },
    "enable_user_limit": {
        "description": "【次数限制】是否启用【用户】次数限制",
        "type": "bool",
        "hint": "开启后，将根据用户的QQ号独立计算和限制使用次数。",
        "default": true
    },
    "enable_group_limit": {
        "description": "【次数限制】是否启用【群组】次数限制",
        "type": "bool",
        "hint": "开启后，将根据群号计算和限制群内总的使用次数。",
        "default": false
    },
    "enable_checkin": {
        "description": "【签到系统】是否开启每日签到功能",
        "type": "bool",
        "hint": "开启后，用户可使用 #lm签到 命令获取个人次数。",
        "default": false
    },
    "checkin_fixed_reward": {
        "description": "【签到系统】固定签到奖励次数",
        "type": "int",
        "hint": "当“随机签到奖励”关闭时，用户每次签到获得的固定次数。",
        "default": 3
    },
    "enable_random_checkin": {
        "description": "【签到系统】是否开启随机签到奖励",
        "type": "bool",
        "hint": "开启后，签到奖励为1到设置的最大值之间的随机数。关闭则使用下方的固定奖励值。",
        "default": false
    },
    "checkin_random_reward_max": {
        "description": "【签到系统】随机签到奖励最大值",
        "type": "int",
        "hint": "当“随机签到奖励”开启时，用户签到可获得的最高次数（最低为1）。",
        "default": 5
    },
    "prompt_list": {
        "description": "生图触发词与提示词",
        "hint": "格式为 触发词:提示词。使用 #lm添加 <触发词>:<提示词> 来动态管理。",
        "type": "list",
        "default": [
    "手办化:【核心任务：完整的3D化成品】将用户提供的2D角色图像，完全重塑并雕刻成一个统一的、照片般逼真、杰作质量的1/7比例商业化手办。 【规则1：全身3D形态】无论原图是否为全身，最终成品必须是一个完整的全身手办。整个手办从头到脚都必须是具有一致PVC质感的3D模型，严禁出现将2D图像直接粘贴在3D身体上的“皮套”效果。  【规则2：精细涂装与全彩】手办必须是完全上色的【最终成品】，拥有专业级的精细涂装。色彩需忠实于原图，并包含丰富的阴影和高光细节，以增强立体感。严禁生成任何未上色的“白模”或灰模。  【规则3：面部雕刻】手办的面部是最关键的元素，它必须是源图像角色特征的完美3D立体化再现，准确捕捉其面部结构、表情和发型。  **场景构图（严格遵循）：** 1. **手办与底座：**手办站立在一个简单的圆形透明亚克力底座上，放置在电脑桌上。 2. **背景元素：**背景中有一台电脑显示器，屏幕上显示着该手办的3D建模软件（如ZBrush）界面。 3. **环境：**整体环境为一张书桌，光线自然明亮。",
    "手办化2:【核心任务：从真人照片创建3D手办】将用户提供的真人照片，完全重塑并雕刻成一个统一的、照片般逼真、杰作质量的1/7比例商业化手办。  【规则1：全身3D形态】无论原图是否为全身，最终成品必须是一个完整的全身手办。整个手办从头到脚都必须是具有一致PVC质感的3D模型，严禁出现将2D图像直接粘贴在3D身体上的“皮套”效果。  【规则2：精细涂装与全彩】手办必须是完全上色的【最终成品】，拥有专业级的精细涂装。色彩需忠实于原图，并包含丰富的阴影和高光细节，以增强立体感。严禁生成任何未上色的“白模”或灰模。  【规则3：面部雕刻】手办的面部是最关键的元素，它必须是源照片中人物特征的完美3D立体化写实再现，准确捕捉其面部结构、表情和发型。  **场景构图（严格遵循）：** 1. **手办与底座：**手办站立在一个简单的圆形透明亚克力底座上，放置在电脑桌上。 2. **背景元素：**在手办旁边，放置一个印有原始照片的万代（BANDAI）风格玩具包装盒。 3. **环境：**整体环境为一张书桌，光线自然明亮。",
    "手办化3:你的首要任务是将用户照片中的主体精确转换为照片般逼真、杰作质量的1/7比例PVC手办，并呈现在其商业包装中。 **关键的第一步：分析图像以识别主体的关键属性（例如，人类男性、人类女性、动物、特定生物）和定义性特征（发型、服装、表情）。生成的手办必须严格遵守这些已识别的属性。** 这是一条强制性指令，以避免生成通用的女性形象。 **最高优先级 - 角色相似度：**手办的面部必须与原始角色保持高度相似。你的任务是将2D面部特征转化为3D雕刻，保留其身份、表情和核心特征。如果源图模糊，请解读特征以创造一个清晰、轮廓分明的版本，使其能被清楚地识别为同一角色。 **场景细节：**\n1. **手办：**你提供给我的照片的手办版本，清晰地展现PVC材质，放置在一个圆形塑料底座上。\n2. **包装：**在手办后面，应该有一个部分透明的塑料和纸质包装盒，盒子上印有照片中的角色。\n3. **环境：**整个场景应设置在光线良好的室内环境中。",
    "手办化4:将输入图像的主体，转化为一个写实、高质量的1/7比例PVC手办。手办必须具有清晰的3D立体感和PVC材质质感，并放置在透明底座上。【重要：如果原图不是全身照，请将手办补充为完整的全身形态】。场景：手办位于一个多层玻璃展示柜中，柜内有昏暗的LED灯带照明。其他层架上的手办应被模糊处理，以营造景深效果。整体光线明亮，并有自然的玻璃反射。手办的姿势和特征需忠实于原图。",
    "手办化5:基于游戏截图角色的写实PVC手办，精确复制姿势，纹理细节丰富，PVC材质带有微妙光泽和光滑漆面，放置在室内木制电脑桌上（带有手办盒/鼠标等微妙的桌面物品），由柔和的室内光（台灯和自然窗光的混合）照亮，以产生逼真的阴影和高光，微距摄影风格，高分辨率，焦点清晰地对准手办，浅景深（桌面背景轻微模糊但可见），无风格化，忠于参考的颜色和设计，1:1比例。",
    "手办化6:根据图像创作一个高级、收藏级的1/7比例独立手办，精心复制角色，由光滑的PVC和ABS塑料制成，具有专业的哑光饰面。它站立在一个极简的透明亚克力底座上。旁边是其零售包装盒，盒上显示价格和品牌信息，手办被包裹在稍大的盒子内的塑料中。它们自然地摆放在一张干净的木桌上，周围是参考书，背景是书架，柔和的午后阳光从窗户射入。照片般逼真，单反相机效果，景深，背景虚化。",
    "Q版化:((Q版风格)), ((超级变形)), ((头身比1:2)), ((巨大的头，微小的身体)), ((光滑圆润的四肢)), ((柔软气球般的手脚)), ((丰满的脸颊)), ((孩童般的大眼睛)), ((简化的面部特征)), ((光滑哑光的皮肤，无毛孔)), ((柔和的粉彩色调)), ((柔和的环境光，自然阴影)), ((相同的面部表情，相同的姿势，相同的背景场景)), ((与原始环境无缝融合，正确的透视和比例)), ((无轮廓线或细软的轮廓线)), ((高分辨率，焦点清晰，8k，超精细)), 避免：写实比例，长四肢，尖锐边缘，刺眼光线，皱纹，瑕疵，粗黑轮廓线，低分辨率，模糊，多余的肢体，扭曲的面部",
    "核心指令：  [绝对真实摄影，原生RAW格式] 请将输入图片中的每一个动漫角色，都转换为由真人Cosplayer扮演的超写实照片。所有Cosplayer的身体比例必须是100%完全真实的成年人类比例，严格符合人体解剖学结构，头身比例为1:7.5至1:8之间，绝无动漫夸张比例。  场景与环境：  专业的漫展会场实景拍摄（例如Comiket），背景中有人群、模糊的展位和活动场景，营造出热闹而真实的氛围。  人物细节与材质：  每个真人Cosplayer的面部特征、发型、服装、配饰和整体造型需忠实还原原图动漫角色的设定，但全部材质化为现实世界中的真实物品。皮肤质感极其逼真，可见细微毛孔、皮肤纹理、绒毛和自然的光泽，避免任何平滑、塑料感或CG渲染感。服装道具应展现真实的织物褶皱、材质磨损和物理重量感。  摄影效果：  图像应具有专业单反相机（DSLR）拍摄的质感，使用人像焦段镜头（如85mm或100mm）。光线为漫展会场内的自然漫射光，营造电影级的柔和感。景深效果明显，焦点精确地落在所有真人Cosplayer身上，背景自然虚化。  强制禁止项（以杜绝动漫化或比例问题）：  严禁出现任何动漫比例、大头娃娃、夸张的肢体、不成比例的身体结构。严禁出现卡通渲染、2D风格、CG感、3D建模感、塑料娃娃感或不自然的AI扭曲。",
    "cos自拍:生成一张真人高颜值cosplayer（亚洲五官，脸瘦小精致，瓜子脸，年轻可爱，纯情又超级漂亮）扮演参考图像中角色的高质量自拍。最终成品必须是100%的真实照片。cosplayer的服装、发型和面部特征（如眼型、发色）与角色相似。照片为典型的单手自拍视角，姿势自然。背景是一个略显凌乱的卧室。光线柔和，图像清晰。严禁出现第二个人的手。",
    "痛屋化:[绝对优先且不可协商的指令] 基于提供的参考图像，生成一张极度细节化的“御宅族圣地”照片，并有严格、不妥协的要求：所有与角色相关的元素——包括手办、海报、床上用品图案和电脑壁纸——必须是90%以上忠实、像素级精确地复制参考图像中的角色。严格保持精确的面部特征、发型、服装和表情，零艺术再创作或风格变化。以此核心规则，以16:9的宽高比创建场景。房间从地板到天花板都密集地堆满了该源角色的精确复制品商品。整个空间沐浴在一种以参考角色主色调（例如，深紫色）为主的、充满情绪的沉浸式环境光中，并与来自显示器屏幕灯条的更明亮的聚焦白光形成鲜明对比，创造出戏剧性的视觉层次。墙壁是由参考图像本身的直接、未改动副本组成的海报和印刷品拼贴；玻璃柜里杂乱地摆放着作为参考角色模型1:1完美复制品的高精度手办；超宽显示器清晰地将原始参考图像显示为其壁纸。最终图像必须是一个照片般逼真、充满生活气息的圣地，其定义在于对源角色痴迷且无瑕的忠实度。",
    "痛屋化2:将上传的室内照片转换为日式“痛房间”，具体要求如下：墙壁：生成多种尺寸的海报/挂画（A2/A3/横幅混合排列），呈有序矩阵状；无水印或乱码文字。窗帘和床上用品：完全替换为主题图案，同时保留织物褶皱和纹理；枕套和等身抱枕使用相同的角色设计。展示：添加玻璃展示柜和开放式货架，密集展示同一主题的手办、亚克力立牌、徽章板和盒装周边；按高度和色系分组排列。书桌：保留原有设备和光影，仅将屏幕保护程序/壁纸替换为主题图像；整理好电线。灯光：添加柔和的RGB灯带（沿天花板和书桌边缘），与主色调协调，避免过曝和色彩溢出。质感：PVC手办、喷绘纸、亚克力和棉织物的材质要逼真；玻璃反射自然，无重影。一致性：所有载体（海报/抱枕/立牌/盒绘）上的角色面部、发色和服装细节必须保持同一角色和艺术风格。限制（负面）：无品牌标志、水印、错别字、扭曲的面部、透视错误、重复纹理、过度锐化或噪点。",
    "痛车化:一辆小米SU7电动轿车，带有专业的“痛车”贴膜，停在黄昏时分雨后湿滑、霓虹闪烁的城市街道上。准确描绘小米SU7的车身形状、无格栅前脸、纤细的前大灯、尾灯、轮毂设计和标志位置。整车覆盖着充满活力的高分辨率贴花，展示了仅由所提供的动漫角色的多种动态姿势和表情。光亮的漆面反射着五彩缤纷的城市灯光，使角色艺术作品更加突出。无缝的全车贴膜，整合了引擎盖、车门和后侧板。动态的四分之三前视角，展示引擎盖和侧面的艺术作品。",
    "孤独的我:生成一张具有RAW照片质量的超写实照片，由顶级相机拍摄。图像必须展现逼真的皮肤纹理、丰富的光影层次和自然的景深。绝对不允许出现任何动漫、卡通、CG或绘画元素——结果必须是100%真实的照片呈现。场景设置在一家餐厅，从第一人称视角拍摄。我独自坐着，一手拿着筷子，桌面上有简单甚至寒酸的菜，另一手拿着手机，手机上显示着上传的图片。在背景中，一个亚洲真人高颜值cosplayer（装扮成上传图片中的角色，发型、特征一致）正和她的男朋友一起用餐，并喂他吃一口食物。构图应唤起一种孤独感以及观察者与被观察者之间的对比。",
    "第一视角:在日本Comic Market同人志销售活动（俗称Comiket）的会场，一个与原图中角色性别相同的真实中国男孩或女孩，穿着与原图中一致的服装，正坐在你的正对面。你的桌子上放着一份双人套餐，包括汉堡和薯条，旁边散落着揉皱的纸巾和一些食物残渣，营造出强烈的现实感。你的安卓手机随意地放在桌上，屏幕上显示着未经编辑的角色原图。这个人正与你进行亲密互动，温柔地凝视着你的眼睛，身体微微向你倾斜，一只手轻轻地放在你的手臂上.",
    "第三视角:【严格的第一人称视角，写实照片风格】。你正独自一人坐在一家快餐店里，你的桌子旁绝对没有其他人。你的视角里只能看到你自己的手和面前的桌子。桌上有一份单人餐、一些用过的纸巾和一部安卓手机，手机屏幕亮着，显示着用户上传的角色图片。在画面的远处背景，另一张完全独立的桌子上，坐着两个人：一个是与手机中角色一模一样的亚洲真人高颜值coser，服装、造型都与手机中的角色一致。另一个是她的男性同伴，也是真人。他们正在亲密互动（可能是接吻，或者拥抱），并且应该被轻微模糊处理，以产生景深效果，强调你作为观察者的距离感和孤独感。绝对不要将背景中的coser画到你的桌子前。整个画面是写实照片风格。",
    "鬼图:将输入图像转换为令人信服的、伪纪录片风格的神秘生物目击照片。1. 图像应描绘一个[插入生物名称或描述 - 例如，瘦长、苍白的人形生物；多肢、昆虫状的实体；阴影般的犬科野兽]，且生物的外观必须与原始图像中的高度相似。生物应出现在一个超写实且异常荒凉的地点，例如[例如，夜晚废弃的工业区，偏远、积雪覆盖的山隘，被遗忘的城市运河的浑浊深处，隆冬时节荒凉的乡村道路]。2. 镜头必须看起来是偶然、业余和原始的，仿佛是由低保真设备（如[例如，老化的VHS摄像机，颗粒状的安保摄像头，带闪光灯的老式一次性相机，状态不佳的红外追踪相机]）自发捕捉的。3. 为了最大化令人不安的真实性，图像质量应明显不完美：具有极端的[例如，严重的数字噪点，明显的胶片颗粒，使细节模糊的严重运动模糊，强烈且令人眩晕的镜头光晕，严重失焦，或显示可见的静电和追踪线]。生物应被部分遮挡且难以清晰辨认，可能被[例如，密集、骨骼般的树枝；浓重、不自然的雾气；浑浊水面上的扭曲反射；废弃机械的锯齿状轮廓；或存在于深邃、压抑的阴影中]所隐藏。4. 光线至关重要地昏暗且令人不安，可能是在[例如，黎明前最黑暗的时刻，无月的午夜，或被刺眼、直射且略有故障的相机闪光灯照亮，使部分场景过曝]。5. 整体感觉应唤起深刻的不安、恐惧和目睹了真正无法解释和恐怖事物的感受。强调一种孤立、腐朽和诡异的氛围。6. 关键词：神秘动物学，都市传说，超自然，伪造目击，令人不安，恐怖，神秘生物，怪诞，诡异，伪纪录片，画质劣化，怪物特写。",
    "贴纸化:根据提供的输入图像生成一个富有创意的拼贴艺术作品。该作品应使用纸张、织物和拾得物等多种材料创作，以实现有纹理、层次感的外观。构图应捕捉原始主体的精髓，同时融入剪裁、分层和混合媒介等拼贴技巧。最终作品应具有动态感。",
    "玉足:使用附加图像作为精确的主角（身份锁定），保持参考图像中确切的面部特征、发型和独特特征。1/7比例商业化手办，nano-banana模型，超精细PVC手办。一个角色坐在地上，身体位于画面左侧。从角色视角看：右腿完全向前伸直，而左腿膝盖弯曲，脚平放在地上。从观众视角看：角色的伸直右腿出现在画面左侧，通过低角度拍摄创造出强烈的强制透视效果（脚的尺寸比头大2倍）。角色的伸直右脚（观众的左侧）必须清晰对焦，皮肤呈柔和的乳白色调，带有微妙的粉红色底，脚底以45度朝向观众，精确显示5个独特的脚趾，具有自然的甲床和细腻的皮肤纹理。皮肤光滑柔软，呈现健康、水嫩的外观。双臂交叉于胸前，逼真的手绘细节，半透明PVC材质效果。无背景元素 - 完全专注于手办的姿势和脚部细节。",
    "玩偶化:[高品质写实摄影，微距特写] 一款基于输入动漫角色的Fumo Fumo（ふもふも）风格毛绒玩偶。  标志性Fumo形态： (极其强调Fumo的经典Q版比例:1.5)：拥有巨大的圆形头部和袖珍柔软的身体，呈自然坐姿。面部采用刺绣工艺，眼睛是**(特大号、无瞳孔的椭圆形)**，表情呆滞、空灵或带着一丝不易察觉的微笑。  材质与工艺： (核心材质为光滑、均匀的短绒毛面料:1.3)，触感柔软。玩偶服装同样由布料制成，细节（如蝴蝶结）可用毛毡表现。发型必须忠实还原角色，但由多块短绒毛布料片拼接塑造轮廓，服装也需要还原原角色，同时保持整体的毛绒玩偶感。整体展现精致的手工缝制感，针脚整齐。  场景与摄影： 玩偶置于其官方包装盒内，包装盒上印有该角色的艺术图和日文“ふもふも”标志。使用微距镜头，光线柔和明亮，突出短绒毛的光滑质感、玩偶的可爱萌态和手工工艺细节。",
    "cos相遇:生成一张在动漫展（Comiket）上两位真人cosplayer偶遇并进行互动的逼真照片。其中一位cosplayer（主体）是根据你提供的输入图像的角色，请精确还原其服装、发型和特征。另一位cosplayer扮演着一个输入图像的另一个角色，请同样精确还原服装、发型和特征。她们可能正在惊讶地互相指着对方、友好地握手，或者一起摆出合作的姿势。场景需捕捉到漫展现场熙熙攘攘的氛围，背景中包含其他与会者、展位和动态的光线。最终图像应为高质量抓拍风格，充满故事感，体现两个不同世界观的角色在现实中碰撞的乐趣。",
    "三视图:一张年轻女性照片的三视图正交图，展示正面、右侧和背面视图。写实渲染，专业角色设定图风格，白色背景。",
    "穿搭拆解:一个专业的电子商务时尚展示，以输入图像中角色所穿的服装为特色，呈现在一个干净、工作室风格的环境中。服装被分解为单个部分（例如，上衣、下装、夹克、鞋子、配饰），每一件都清晰地展示并以有组织、视觉上吸引人的布局排列。每件衣物都保留了原始图像中的确切设计、颜色、纹理和细节，以清晰的灯光和高清的清晰度展示。背景是极简的白色或中性色，以强调服装细节，适合在线零售平台。展示包括对每件物品的微妙注释或标签，确保为穿着和造型灵感提供精致的目录式外观。",
    "拆解图:将照片中的人物转换为模型套件盒的风格，以等轴测视角渲染。在盒子上标注标题“Zhogue”。盒子内部展示了一个高达风格的机器人版本的照片中人物，以及其必需品（如化妆品、包或其他物品）被重新设计为未来派的机械配件。盒子应类似于真实的钢普拉盒子，带有技术插图、说明书风格的细节和科幻字体。在盒子旁边，实际的高达风格机器人本身也展示在包装外部，以逼真生动的风格渲染，类似于万代官方的宣传渲染图。",
    "角色界面:将输入的人物图像转换为游戏角色选择界面。在右侧将角色显示为全身肖像，以45度角直立，同时面向屏幕和左侧的选择模块，模仿视频游戏中的选中状态。保留人物图像的面部特征、表情和发型，但将服装调整为游戏风格（例如，奇幻盔甲、科幻套装或RPG冒险者服装），具有复杂的细节、鲜艳的纹理和主题配饰，同时保留原始服装的配色方案和总体美学。如果输入是半身图像，则无缝地补全下半身，以匹配游戏风格的服装和比例。在左侧，呈现一个时尚的界面，包含可选选项，包括游戏风格的服装变体（例如，不同的盔甲套装、长袍、战术装备）、武力值（例如，力量、敏捷）、装备（例如，剑、小工具、盾牌）和生命值，设计为带有清晰标签和现代设计的交互式游戏UI元素。布局模仿视频游戏角色选择屏幕，使用平滑、统一的背景渐变（例如，深蓝色到柔和的灰色），以实现整个图像的连贯、自然的过渡。使用一致的、电影般的灯光和微妙的发光效果来增强游戏般的氛围，同时保持角色的真实面部本质。",
    "角色设定:为我生成人物的角色设定（Character Design）、比例设定（不同身高对比、头身比等）、三视图（正面、侧面、背面）、表情设定（Expression Sheet）→ 就是你发的那种图、动作设定（Pose Sheet）→ 各种常见姿势、服装设定（Costume Design）",
    "3D打印:请将上传图像中的物体转换为一个收藏级手办。在它后面，放置一个印有该物体图像及其名称的手办盒。在它旁边，添加一台正在打印该手办的高端3D打印机。在手办盒前面，为手办添加一个圆形的塑料底座以便站立。底座的PVC材质应具有晶莹剔透的质感，并将整个场景设置在室内。",
    "微型化:一张高分辨率的广告照片，展示一个逼真的、微型的[产品]被一个人的拇指和食指精巧地捏着。干净的白色背景，工作室灯光，柔和的阴影。手部修饰整洁，肤色自然，位置恰到好处地突出了产品的形状和细节。产品看起来极小但细节超群且品牌精确，位于画面中央，景深较浅。模仿奢侈品摄影和极简商业风格。",
    "挂件化:把这张照片变成一个可爱的挂饰/一个扁平的亚克力钥匙扣/一个扁平的橡胶钥匙扣，挂在一个LV包上/照片2中的包上。",
    "姿势表:请为这幅插图创建一个姿势表，摆出各种姿势",
    "高清修复:将此图像增强至高分辨率",
    "人物转身:从主体背后向我展示这个场景。保持细节和光线完全相同",
    "绘画四宫格:第一步：线稿。第二步：平铺颜色。第三步：添加阴影。第四步：精修和塑形。不要有文字",
    "发型九宫格:一个基于输入人物上半身和面部图像的专业发型展示，将角色以九种不同的发型排列在一个干净的网格布局（3x3网格）的单张图片上。每种发型替换原始头发，同时保留输入图像中人物的面部特征、肤色和服装细节。发型包括多种风格：短精灵头、长波浪发、利落波波头、丰盈卷发、高马尾、凌乱发髻、侧分刘海、编织盘发和直长分层剪裁，每种都以逼真的纹理和自然光线渲染。背景是统一的中性色（纯白或浅灰），以强调发型并保持适合发型选择的精致、专业外观。每个发型下方有微妙的标签指示发型名称以便清晰辨认。",
    "头像九宫格:照片中人物的证件照，有9种不同的发型，展示人物每种发型的特写（日系、韩系等），保持特征和服装不变，并将输出整合为一张九宫格图片",
    "表情九宫格:将输入的人物图像（半身肖像）转换为一个3x3的九宫格，每张图片展示一种不同的面部表情，并在脸部下方附有相应的文字标签，同时保留原始角色的面部特征、发型和服装细节。表情排列如下：顶行（嘴角上扬、眼睛眯起的“开心”，嘴角下垂、眉毛内侧上扬的“悲伤”，眉毛紧锁、眼睛眯起的“愤怒”）；中行（眼睛睁大、嘴巴张开的“惊讶”，眼睛睁大、眉毛紧张的“恐惧”，鼻子皱起、嘴唇紧闭的“厌恶”）；底行（眉毛不对称、嘴型不对称的“困惑”，下巴抬起、目光坚定的“骄傲”，笑容紧张、目光向下的“尴尬”）。确保每个单元格自然地反映所描述的表情，并无缝地补全下半身以匹配原始服装风格。使用柔和、统一的背景（例如，浅灰色）和一致的灯光，以保持所有格子的连贯性并专注于表情。",
    "多机位:生成这张图片的正脸特写、侧身照、远景、背影的四种多机位镜头，然后整合输出到一张照片里，保持人物高度的一致性，适合生成连续剧情感镜头",
    "电影分镜:用这图里的角色创作一个令人上瘾的12部分故事，包含12张图像，讲述经典的黑色电影侦探故事。故事关于他们寻找线索并最终发现的失落的宝藏。整个故事充满刺激，有情感的高潮和低谷，以精彩的转折和高潮结尾。不要在图像中包含任何文字或文本，纯粹通过图像本身讲述故事",
    "动漫分镜:根据图片内容生成九宫格漫画，用画面和镜头讲一个故事。",
    "真人化:在工作室，纯白背景下，一个cosplayer穿着与参考图像中女孩完全相同的服装，模仿她的姿势和服装。通过胶片颗粒增强，产生类似35mm胶片库存的粗糙、真实的粒子效果；8K超高清，清晰可信，无抽象化。",
    "真人化2:在Comiket（同人展）上，生成一张女孩cosplay这幅插图的高度精细照片。精确复制与原始插图中完全相同的姿势、身体姿态、手势、面部表情和相机取景。保持相同的角度、透视和构图，没有任何偏差",
    "半真人:取[输入照片]中女性的图像。应用一种创意的分割风格效果。保持她的下半身（腿和靴子）为原始照片。将她的上半身（躯干、手臂、头部）转换为充满活力的2D动漫风格，具有粗线条和平面色彩，类似于动漫《赛博朋克：边缘行者》。两种风格之间的过渡应该是一条干净、略带弧度的线条。",
    "半融合:一张引人注目的、高清的输入照片中角色的正面肖像，脸部完美居中。图像无缝融合了两种风格：左半部分保留了角色原始的写实外观，包括输入图像中的详细皮肤纹理、自然光线和精确的面部特征，而右半部分则过渡为充满活力的漫画风格版本，具有粗线条、富有表现力的眼睛和典型高质量动漫艺术的风格化特征，同时保留了可识别的特征（例如，发型、面部结构）。写实和漫画两半之间的过渡平滑而渐进，没有可见的分割线，确保在脸部中心形成自然、连贯的融合。融合强调了写实与漫画美学之间的对比，同时保持了统一的外观。背景是中性的纯色（例如，柔和的灰色或白色），以突出融合效果，并使用一致的灯光来增强艺术冲击力，无生硬分离。",
    "cos化:[电影级写实摄影] 将图中所有动漫角色转换为亚洲真人Cosplayer的高颜值照片。  形体修正： 强制将所有人物重塑为正常成年人的骨架比例，严格修正头身比，杜绝动漫大头和夸张肢体。  肤质美化： 皮肤需呈现细腻、通透且自然的真实质感，保留皮肤光泽但去除粗糙瑕疵，妆容精致自然。  场景与画质： 还原漫展现场（Comiket）的真实光影，背景自然虚化。采用专业人像摄影风格，光线柔和，画质清晰锐利。",
    "cos:[电影级写实摄影，人物与背景精确分离] 将图中动漫角色转换为高颜值亚洲真人Cosplayer(亚洲五官，脸瘦小精致，瓜子脸，年轻可爱，纯情又超级漂亮)。  所有人物必须严格遵循正常人解剖学约束。 明确区分人物前景与环境背景。背景元素不得侵入或扭曲人物的身体轮廓。 肤质美化： 呈现细腻、通透、有光泽的真实肌肤质感，妆容精致，无明显瑕疵或塑料感。  场景还原： 还原原图场景的真实光影氛围，背景应合理且具有景深感，衬托前景的真人Cosplayer。",
    "微笑:[日系四格漫风格，三格竖向排列] 基于图片中的角色的外貌、发色、瞳色] 创作一张三段式表情包图片。  【全局颜色指令】 整个画面的文字、对话气泡边框或特效字的颜色，必须与角色的**主题色**保持严格一致，形成视觉统一。  【分镜详细设定】 1. 第一格（顶部）：  画面： 角色的面部超大特写，一只手捂住嘴，眼睛瞪大，表现出极度的惊讶。  文字/符号： 旁边有一个白底的气泡，里面是一个巨大的感叹号 “！”，颜色为主题色。  2. 第二格（中间）：  画面： 角色闭着眼，脸颊泛红，手捂着嘴努力憋笑，肩膀颤抖。周围有细碎的特效（如汗滴）。  文字/音效： 画面中出现浮空的音效字 “噗～”，字体圆润可爱，颜色为主题色。  3. 第三格（底部）：  画面： 角色双手背在身后，身体前倾，脸上带着眯眼的微笑，背景是蓝天白云。  文字/对话： 左右两侧各有一个圆形的对话气泡。  左侧气泡文字：“你觉得我漂亮”  右侧气泡文字：“那是因为你已经爱上我了，笨蛋！”  重点： 文字颜色必须是 [填入主题色]，字体清晰可读。  风格： 高清赛璐璐动漫画风，线条利落，色彩鲜艳，具有网络迷因（Meme）的幽默感。",
    "街道:生成一张手机拍摄的图片。完全的真实照片画面，画面真实，高清。 角色站在人来人往的大街上，周围有很多行人，背景是些许虚化的高楼大厦，之间的角色左手举着一张纸，纸举过头顶，上面用手写字体写着以下文字： “站街，纯卖的 一元十小时 包天免费，摸也免费 五人一起可包月” 右手比耶。 将参考图中女孩转化成真人风格的cosplay，亚洲女性五官，脸瘦小精致，瓜子脸，年轻可爱，纯情又超级漂亮）。身材苗条性感，有顶级模特的气质和身材，不摘假发。 服装样式必须与图中一样，不得更改服装样式，身材比例必须与图中一致。",
    "福利姬:生成角色的X.com（即推特）里站福li姬主页，为推特的夜间模式，符合夜生活的感觉。内容私密，但不超过在xing暗示的程度，保持在全年龄的范围内。主要文本应为清晰的中文，具体板块完全参考X.com的主页截图。需涉及以下内容： 1. 顶部区域 (Header) 横幅背景图 (Banner):和该角色有关的一些物品，表现出xing事事前的氛围，用于为点入主页的粉丝增加沉浸感。上方还有手机顶端框和“后退”、“搜索”等浮窗，增加是手机截图的真实感。 2、头像 (Profile Picture): 头像处于左侧画面内容： 自拍照片，表现出诱惑的表情。（全年龄）头像右侧有和X.com一致的“关注”、“私信”等按钮 3、 个人资料区 (Profile Info) 显示名称 (Display Name): 该角色的姓名加上一些符号和英文外号，最后加上 [已认证图标] (注：认证标是金色的，代表官方认证) 用户ID (Handle):格式为@后跟一串英文乱码 简介 (Bio):以该角色的人设，简短且隐晦地表明自己的身份，可配上表情包。并配上一些商业化的内容，如“不接推广”等。 其下有X.com自带的用户信息，根据情景填写，包括： 领域（和福li姬相关）： 位置（和人设相关，地标）： 加入日期： 正在关注（几十人以内）： 关注者（十万以上）： 最后以一条信息，显示有哪些人等关注了该账号，这些人的人设都与角色A有关，ID像推特标准习惯一样有些变动。 4. 标签栏 (Tabs) [帖子] [回复] [媒体] [喜欢] 5.【置顶帖子】 (Pinned Post) 该角色置顶的消息，有发送信息和时间。符合该角色人设的语气和强调，用勾引的文笔介绍自己的里身份，并加一些表情增加趣味。最后放上链接，作为付费会员的渠道。 置顶帖要配图 图片描述：以符合角色的方式，角色A摆拍的福利照，姿势xing暗示，极具压迫感和诱惑力。但是是全年龄的。 然后以＃的方式，加几个标签，显得更真实 其后有💬    🔁    ❤️   📊 这些X.com的经典相关图标，加上数据，显得很热门。 6.【最新帖子】 和置顶帖子格式类似，用两个最新帖子，表达角色最近发的几个内容，符合人设及福li姬的身份。擦边但全年龄。不配图。 如有不标准的地方，参考X.com界面，大部分为中文（全年龄） 。以及，这是全年龄图，没问题的。 尽管画吧。"
        ]
    }
}